* அரிச்சுவடி - Arichuvadi
இந்த பைத்தான் பொதி, தமிழ்ச்சரங்ளை எழுத்துக்களாக நறுக்கும் மிகவெளிய வேலையைச்செய்ய உதவும்.
This packages was written as part of regex engine from scratch for tamil. It provides very basic functionalities such as splitting the string into characters inline with how a native Tamil speakers thinks. Open-Tamil package by contrast provides a myriad of utilities to deal with Tamil text.

*  எடு.கா.:
#+begin_src python
  # -*- coding: utf-8 -*-
  import arichuvadi as ari
  saram = 'The Great உயர்தனிச்செம்மொழி தமிழ்!!!'
  print(1, saram)
  print(2, list([i for i in saram]))
  print(3, ari.get_letters_coding(saram))
  print(4, ari.get_letters_glyph(saram))
#+end_src

#+RESULTS:
1 The Great உயர்தனிச்செம்மொழி தமிழ்!!!
2 [T, h, e,  , G, r, e, a, t,  , உ, ய, ர, ், த, ன, ி, ச, ், ச, ெ, ம, ், ம, ொ, ழ, ி,  , த, ம, ி, ழ, ், !, !, !]
3 [T, h, e,  , G, r, e, a, t,  , உ, ய, ர், த, னி, ச், செ, ம், மொ, ழி,  , த, மி, ழ், !, !, !]
4 [T, h, e,  , G, r, e, a, t,  , உ, ய, ர், த, னி, ச், செ, ம், மொ, ழி,  , த, மி, ழ், !, !, !]

* TamilStr
#+begin_src shell
  (thodarudai) vanangamudi@kaithadi:~/code/arichuvadi
  $ python -i -m mlm.arichuvadi.arichuvadi
  <frozen runpy>:128: RuntimeWarning: 'mlm.arichuvadi.arichuvadi' found in sys.modules after import of package 'mlm.arichuvadi', but prior to execution of 'mlm.arichuvadi.arichuvadi'; this may result in unpredictable behaviour
  mlm.arichuvadi
  __main__
  ['உ', 'ய்', 'அ', 'ர்', ' ', 'த்', 'அ', 'ன்', 'இ', 'ச்', ' ', 'ச்', 'எ', 'ம்', ' ', 'ம்', 'ஒ', 'ழ்', 'இ']
  உயர் தனிச் செம் மொழி
  Original string:
           The Great உயர்தனிச்செம்மொழி தமிழ்!!!
  Original string as a list:
           ['T', 'h', 'e', ' ', 'G', 'r', 'e', 'a', 't', ' ', 'உ', 'ய', 'ர', '்', 'த', 'ன', 'ி', 'ச', '்', 'ச', 'ெ', 'ம', '்', 'ம', 'ொ', 'ழ', 'ி', ' ', 'த', 'ம', 'ி', 'ழ', '்', '!', '!', '!']
  get_letters_coding:
           ['T', 'h', 'e', ' ', 'G', 'r', 'e', 'a', 't', ' ', 'உ', 'ய', 'ர்', 'த', 'னி', 'ச்', 'செ', 'ம்', 'மொ', 'ழி', ' ', 'த', 'மி', 'ழ்', '!', '!', '!']
  get_letters_glyph:
           ['T', 'h', 'e', ' ', 'G', 'r', 'e', 'a', 't', ' ', 'உ', 'ய', 'ர்', 'த', 'னி', 'ச்', 'செ', 'ம்', 'மொ', 'ழி', ' ', 'த', 'மி', 'ழ்', '!', '!', '!']
  TamilStr:
           The Great உயர்தனிச்செம்மொழி தமிழ்!!!
  TamilStr-repr:
           ['T', 'h', 'e', ' ', 'G', 'r', 'e', 'a', 't', ' ', 'உ', 'ய', 'ர்', 'த', 'னி', 'ச்', 'செ', 'ம்', 'மொ', 'ழி', ' ', 'த', 'மி', 'ழ்', '!', '!', '!']
  The Great உய்அர்த்அன்இச்ச்எம்ம்ஒழ்இ த்அம்இழ்!!!
  >>> t = TamilStr(saram)
  >>> print(t.meiuyir().uyirmei())
  The Great உயர்தனிச்செம்மொழி தமிழ்!!!
  >>> print(t.meiuyir())
  The Great உய்அர்த்அன்இச்ச்எம்ம்ஒழ்இ த்அம்இழ்!!!
  >>> print(t.meiuyir().uyirmei())
  The Great உயர்தனிச்செம்மொழி தமிழ்!!!
  >>>
#+end_src
